Repository: AngelAuraMC/Amethyst-iOS
Catalog: Natives/resources/*.lproj/Localizable.strings
Languages: th

# game.menu.force_close
source: Force close
th: บังคับปิด

# game.menu.confirm.force_close
source: Are you sure you want to force exit?
th: คุณแน่ใจหรือไม่ว่าคุณต้องการบังคับปิด?

# game.menu.log_output
source: Log output
th: ประวัติที่บันทึกไว้

# game.menu.custom_controls
source: Custom controls
th: การควบคุมกำหนดเอง

source: Play
th: เริ่ม

source: Installed
th: ติดตั้งแล้ว

source: Snapshot
th: ตัวเกมพรีวิว ( snapshot )

source: Releases
th: เผยแพร่

# Old-beta
source: Old-alpha
th: เบต้าเก่า

source: Old-alpha
th: อัลฟ่าเก่า

source: Copy
th: คัดลอก

source: Edit
th: แก้ไข

source: Move
th: ย้าย

source: Remove
th: ถอดออก

source: Resize
th: ปรับขนาด

# custom_controls.button_edit.forward_lock
source: Forward lock
th: ล็อคไปข้างหน้า ( วิ่ง )

# custom_controls.button_edit.name
source: Name
th: ชื่อ

# custom_controls.button_edit.size
source: Size
th: ขนาด

# custom_controls.button_edit.mapping
source: Mapping
th: ปุ่มที่ให้กด

# custom_controls.button_edit.orientation
source: Orientation
th: ทิดทางการหัน

# custom_controls.button_edit.toggleable
source: Toggleable
th: สามารถกดค้าง

# custom_controls.button_edit.swipeable
source: Swipeable
th: ลากได้

# custom_controls.button_edit.bg_color
source: Background color
th: สีพื้นหลัง

# custom_controls.button_edit.stroke_color
source: Stroke color
th: สีของเส้นขอบ

# custom_controls.button_menu.add_subbutton
source: Add sub-button
th: เพื่มปุ่มรอง

# custom_controls.control_menu.discard_changes
source: Discard changes
th: ยกเลิกการเปลี่ยนแปลง

# custom_controls.control_menu.exit
source: Exit
th: ออก

# custom_controls.control_menu.exit.warn
source: You are about to exit without saving changes.
th: คุณกำลังจะออกโดยลืมการบันทึกการเปลี่ยนเเปลง

# custom_controls.control_menu.save
source: Save
th: บันทึก

# custom_controls.control_menu.save.error.json
source: JSON error
th: ข้อผิดพลาดบน JSON

# custom_controls.control_menu.save.error.write
source: Error saving file
th: เกิดข้อผิดพลาดในการบันทึกไฟล์

# custom_controls.control_menu.load
source: Load
th: โหลด

# custom_controls.control_menu.make_default
source: Make default
th: ทำให้เป็นค่าเริ่มต้น

# custom_controls.control_menu.safe_area
source: Safe area
th: ขอบเขตปลอดภัย

# custom_controls.control_menu.add_button
source: Add button
th: เพิ่มปุ่ม

# custom_controls.control_menu.add_joystick
source: Add joystick
th: เพิ่มจอยสติ๊ก ( สำหรับเคลื่อนที่ )

# launcher.menu.custom_controls
source: Custom controls
th: การควบคุมกำหนดเอง

# login.option.add
source: Add account
th: เพิ่มบัญชี

# login.option.select
source: Select account
th: เลือกบัญชี

# login.option.microsoft
source: Microsoft account
th: บัญชี ไมโครซอฟท์

# login.option.local
source: Local account
th: บัญชีในเครื่อง

source: News
th: ข่าวสาร

source: Settings
th: การตั้งค่า

# preference.section.control
source: Control customization
th: ปรับเเต่งการควบคุม

# preference.section.java
source: Java Tweaks
th: จาวาทวิก

# preference.title.game_directory
source: Game directory
th: ตำเเหน่งโฟรเดอร์เกม

# preference.title.cosmetica
source: Cosmetica Capes
th: ผ้าคลุมที่มีภาพ

# preference.title.renderer
source: Renderer
th: ตัวแสดงผล

# preference.title.gyroscope_enable
source: Enable gyroscope controls
th: เปิดใช้งานการควบคุมไจโรสโคป

# preference.title.gyroscope_sensitivity
source: Gyroscope controls sensitivity
th: ความรวดเร็วในการควบคุมไจโร

# preference.title.java_args
source: JVM Launch arguments
th: อาร์กิวเมนต์เปิดใช้ JVM

# preference.title.auto_ram
source: Auto RAM
th: RAM อัตโนมัติ

# preference.detail.auto_ram
source: Enables automatic RAM adjuster
th: เปิดใช้งานตัวปรับ RAM อัตโนมัติ

# preference.detail.allocated_memory
source: Controls how much memory is given to Minecraft
th: ควบคุมเเรมที่จะให้กับเกมมายคราฟ

# preference.profile.title.name
source: Name
th: ชื่อ

# preference.profile.title.version
source: Version
th: เวอร์ชัน

# profile.title.create
source: Create new profile
th: สร้างโปรไฟล์ใหม่

# controller_configurator.playstation.title.named_back
source: Select
th: เลือก
